
## Plan Result (demo)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 7 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;recipes&#34;]
  * module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs[&#34;recipes&#34;]
* Update
  * module.recipes-redis-storage.azurerm_redis_cache.redis
* Delete
  * azurerm_key_vault_secret.POSTGRES_DATABASE_CFT
  * azurerm_key_vault_secret.POSTGRES_DATABASE_SDS
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;plum&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;toffee&#34;]
  * module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs[&#34;plum&#34;]
  * module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs[&#34;toffee&#34;]
  * module.vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy[&#34;plum&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo"
      + name                    = "recipes-backend-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE_CFT will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE_CFT is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE_CFT" {
      - id                      = "https://recipeskv-demo.vault.azure.net/secrets/recipes-backend-POSTGRES-DATABASE-CFT/2ef5bfa03ffc4d93be43e5b5834360f5" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo" -> null
      - name                    = "recipes-backend-POSTGRES-DATABASE-CFT" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo/secrets/recipes-backend-POSTGRES-DATABASE-CFT/versions/2ef5bfa03ffc4d93be43e5b5834360f5" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo/secrets/recipes-backend-POSTGRES-DATABASE-CFT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "2ef5bfa03ffc4d93be43e5b5834360f5" -> null
      - versionless_id          = "https://recipeskv-demo.vault.azure.net/secrets/recipes-backend-POSTGRES-DATABASE-CFT" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE_SDS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE_SDS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE_SDS" {
      - id                      = "https://recipeskv-demo.vault.azure.net/secrets/recipes-backend-POSTGRES-DATABASE-SDS/8cffc9ec94de48e1be7ac08abaae9750" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo" -> null
      - name                    = "recipes-backend-POSTGRES-DATABASE-SDS" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo/secrets/recipes-backend-POSTGRES-DATABASE-SDS/versions/8cffc9ec94de48e1be7ac08abaae9750" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo/secrets/recipes-backend-POSTGRES-DATABASE-SDS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "8cffc9ec94de48e1be7ac08abaae9750" -> null
      - versionless_id          = "https://recipeskv-demo.vault.azure.net/secrets/recipes-backend-POSTGRES-DATABASE-SDS" -> null
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["plum"] will be destroyed
  # (because key ["plum"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      - charset   = "UTF8" -> null
      - collation = "en_GB.utf8" -> null
      - id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/recipes-flexible-demo/databases/plum" -> null
      - name      = "plum" -> null
      - server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/recipes-flexible-demo" -> null
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["recipes"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "recipes"
      + server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/recipes-flexible-demo"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["toffee"] will be destroyed
  # (because key ["toffee"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      - charset   = "UTF8" -> null
      - collation = "en_GB.utf8" -> null
      - id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/recipes-flexible-demo/databases/toffee" -> null
      - name      = "toffee" -> null
      - server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/recipes-flexible-demo" -> null
    }

  # module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs["plum"] will be destroyed
  # (because key ["plum"] is not in for_each map)
  - resource "null_resource" "set-user-permissions-additionaldbs" {
      - id       = "2456046093422770217" -> null
      - triggers = {
          - "db_reader_user" = "DTS CFT DB Access Reader"
          - "force_trigger"  = null
          - "name"           = "recipes-flexible"
          - "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        } -> null
    }

  # module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs["recipes"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = null
          + "name"           = "recipes-flexible"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs["toffee"] will be destroyed
  # (because key ["toffee"] is not in for_each map)
  - resource "null_resource" "set-user-permissions-additionaldbs" {
      - id       = "6619706629854365402" -> null
      - triggers = {
          - "db_reader_user" = "DTS CFT DB Access Reader"
          - "force_trigger"  = null
          - "name"           = "recipes-flexible"
          - "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        } -> null
    }

  # module.recipes-redis-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.Cache/redis/recipes-session-storage-demo"
        name                               = "recipes-session-storage-demo"
        tags                               = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/recipes-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "demo"
            "managedBy"           = "CNP"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (14 unchanged attributes hidden)
        }
    }

  # module.vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy["plum"] will be destroyed
  # (because key ["plum"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_names_access_policy" {
      - id                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo/objectId/ff068b50-4dc6-4143-bb0d-4c2bd58f1669" -> null
      - key_vault_id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.KeyVault/vaults/recipeskv-demo" -> null
      - object_id          = "ff068b50-4dc6-4143-bb0d-4c2bd58f1669" -> null
      - secret_permissions = [
          - "Get",
          - "List",
        ] -> null
      - tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

Plan: 3 to add, 1 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->